gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
/*! @name FLEXSPI0B_DATA5 (coord R2), U19[E3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_SIGNAL FLEXSPI_B_DATA5
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_PIN 18U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_PIN_MASK (1U << 18U)
/* @} */

/*! @name FLEXSPI0B_DATA6 (coord P3), U19[E2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_SIGNAL FLEXSPI_B_DATA6
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_PIN 22U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_PIN_MASK (1U << 22U)
/* @} */

/*! @name FLEXSPI0B_DATA7 (coord P5), U19[E1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_SIGNAL FLEXSPI_B_DATA7
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_PIN_MASK (1U << 23U)
/* @} */

/*! @name FLEXSPI0B_SS0_N (coord T2), U19[C2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_SIGNAL FLEXSPI_B_SS0_B
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_PIN 19U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_PIN_MASK (1U << 19U)
/* @} */

/*! @name FLEXSPI0B_SCLK (coord U3), U19[B2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_SCK_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_SCK_SIGNAL FLEXSPI_B_SCLK
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_SCK_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_SCK_PIN 29U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_SCK_PIN_MASK (1U << 29U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPIFlashPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI0A_DATA0 (coord T5), U108[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_SIGNAL FLEXSPI_A_DATA0    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DATA1 (coord U5), U108[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_SIGNAL FLEXSPI_A_DATA1    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DATA2 (coord P6), U108[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_SIGNAL FLEXSPI_A_DATA2    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DATA3 (coord P7), U108[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_SIGNAL FLEXSPI_A_DATA3    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DATA4 (coord T7), U108[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_SIGNAL FLEXSPI_A_DATA4    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DATA5 (coord U7), U108[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_SIGNAL FLEXSPI_A_DATA5    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

