gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
/*! @name FLEXSPI0A_DATA6 (coord R7), U108[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_SIGNAL FLEXSPI_A_DATA6    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DATA7 (coord T8), U108[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_SIGNAL FLEXSPI_A_DATA7    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name FLEXSPI0A_DQS (coord U9), U108[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_SIGNAL FLEXSPI_A_DQS      /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name FLEXSPI0A_SCLK (coord T9), U108[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_SIGNAL FLEXSPI_A_SCLK     /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name FLEXSPI0A_SS0_N (coord T4), U108[A3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_CE_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_CE_SIGNAL FLEXSPI_A_SS0_B    /*!<@brief Signal name */
#define BOARD_INITPSRAMPINS_PSRAM_CE_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPSRAMPINS_PSRAM_CE_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPSRAMPINS_PSRAM_CE_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPSRAMPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SD0_D0 (coord R11), J32[7]/SD_DAT0
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHC0PINS_SD_DAT0_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHC0PINS_SD_DAT0_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHC0PINS_SD_DAT0_CHANNEL 0                /*!<@brief Signal channel */
#define BOARD_INITUSDHC0PINS_SD_DAT0_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHC0PINS_SD_DAT0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHC0PINS_SD_DAT0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name SD0_D1 (coord T11), J32[8]/SD_DAT1
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHC0PINS_SD_DAT1_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHC0PINS_SD_DAT1_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHC0PINS_SD_DAT1_CHANNEL 1                /*!<@brief Signal channel */
#define BOARD_INITUSDHC0PINS_SD_DAT1_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHC0PINS_SD_DAT1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHC0PINS_SD_DAT1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name SD0_D2 (coord U11), J32[9]/SD_DAT2
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHC0PINS_SD_DAT2_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHC0PINS_SD_DAT2_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHC0PINS_SD_DAT2_CHANNEL 2                /*!<@brief Signal channel */
#define BOARD_INITUSDHC0PINS_SD_DAT2_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHC0PINS_SD_DAT2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHC0PINS_SD_DAT2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name SD0_D3 (coord T12), J32[1]/SD_DAT3
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHC0PINS_SD_DAT3_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHC0PINS_SD_DAT3_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHC0PINS_SD_DAT3_CHANNEL 3                /*!<@brief Signal channel */
#define BOARD_INITUSDHC0PINS_SD_DAT3_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHC0PINS_SD_DAT3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHC0PINS_SD_DAT3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name SD0_CLK (coord P10), J32[5]/SD_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHC0PINS_SD_CLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITUSDHC0PINS_SD_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITUSDHC0PINS_SD_CLK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHC0PINS_SD_CLK_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHC0PINS_SD_CLK_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name SD0_CMD (coord R9), J32[2]/SD_CMD
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHC0PINS_SD_CMD_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITUSDHC0PINS_SD_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITUSDHC0PINS_SD_CMD_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHC0PINS_SD_CMD_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHC0PINS_SD_CMD_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                              /* @} */

