gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 10U)         /*!<@brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_SW2_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 10U                           /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 10U)              /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_1 (coord G15), SW1
  @{ */
/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_SW1_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SW1_SIGNAL PIO1                       /*!<@brief Signal name */
#define BOARD_INITBUTTONSPINS_SW1_CHANNEL 1                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW1_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW1_GPIO_PIN_MASK (1U << 1U)          /*!<@brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_SW1_PORT 1U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW1_PIN 1U                            /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW1_PIN_MASK (1U << 1U)               /*!<@brief PORT pin mask */
                                                                    /* @} */

/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_nRESET_TRGT_PERIPHERAL SYSCON       /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_nRESET_TRGT_SIGNAL RESET            /*!<@brief Signal name */
/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC2_RTS_SCL_SSEL1 (coord B7), J28[10]/J30[6]/U6[4]
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_FC2_I2C_SCL_PERIPHERAL FLEXCOMM2         /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_FC2_I2C_SCL_SIGNAL RTS_SCL_SSEL1         /*!<@brief Signal name */
#define BOARD_INITACCELPINS_FC2_I2C_SCL_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_FC2_I2C_SCL_PIN 18U                      /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_FC2_I2C_SCL_PIN_MASK (1U << 18U)         /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name FC2_CTS_SDA_SSEL0 (coord D7), J28[9]/J30[5]/J47[8]/U6[6]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_FC2_I2C_SDA_PERIPHERAL FLEXCOMM2
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_FC2_I2C_SDA_SIGNAL CTS_SDA_SSEL0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_FC2_I2C_SDA_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_FC2_I2C_SDA_PIN 17U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_FC2_I2C_SDA_PIN_MASK (1U << 17U)
/* @} */

/*! @name PIO1_5 (coord J16), J28[4]/JP30[1]/J45[22]
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_ACC_INT_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_ACC_INT_SIGNAL PIO1                       /*!<@brief Signal name */
#define BOARD_INITACCELPINS_ACC_INT_CHANNEL 5                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACC_INT_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_INT_GPIO_PIN_MASK (1U << 5U)          /*!<@brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACC_INT_PORT 1U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_INT_PIN 5U                            /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACC_INT_PIN_MASK (1U << 5U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO1_7 (coord J15), J28[2]/J45[36]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_ACC_RESET_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_ACC_RESET_SIGNAL PIO1
/*!
 * @brief Signal channel */
#define BOARD_INITACCELPINS_ACC_RESET_CHANNEL 7

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_RESET_GPIO GPIO
/*!
 * @brief GPIO output initial state */
#define BOARD_INITACCELPINS_ACC_RESET_INIT_GPIO_VALUE 1U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACC_RESET_GPIO_PIN_MASK (1U << 7U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_RESET_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_ACC_RESET_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_ACC_RESET_PIN_MASK (1U << 7U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u      /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u   /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u          /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_EN 0x40u       /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u         /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u    /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u      /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u        /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_SLOW 0x80u /*!<@brief Slow mode */

/*! @name PIO2_30 (coord P16), J18[2]/U8[3]/U17[B6]/SDA_CODEC
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI3CPINSASGPIO_I3C0_SDA_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITI3CPINSASGPIO_I3C0_SDA_SIGNAL PIO2
/*!
 * @brief Signal channel */
#define BOARD_INITI3CPINSASGPIO_I3C0_SDA_CHANNEL 30

