gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
/*! @name SD0_CARD_DET_N (coord R13), J32[10]/CARD_CD/SD_CD
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_CD_PERIPHERAL USDHC0             /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_CD_SIGNAL USDHC_CD_B             /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_CD_PORT 2U                       /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_CD_PIN 9U                        /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_CD_PIN_MASK (1U << 9U)           /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name SD0_CLK (coord P10), J32[5]/SD_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_CLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_CLK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_CLK_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_CLK_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name SD0_CMD (coord R9), J32[2]/SD_CMD
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_CMD_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_CMD_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_CMD_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_CMD_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name SD0_D0 (coord R11), J32[7]/SD_DAT0
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_DAT0_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_DAT0_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_DAT0_CHANNEL 0                /*!<@brief Signal channel */
#define BOARD_INITUSDHCPINS_SD_DAT0_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_DAT0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_DAT0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name SD0_D1 (coord T11), J32[8]/SD_DAT1
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_DAT1_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_DAT1_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_DAT1_CHANNEL 1                /*!<@brief Signal channel */
#define BOARD_INITUSDHCPINS_SD_DAT1_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_DAT1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_DAT1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name SD0_D2 (coord U11), J32[9]/SD_DAT2
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_DAT2_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_DAT2_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_DAT2_CHANNEL 2                /*!<@brief Signal channel */
#define BOARD_INITUSDHCPINS_SD_DAT2_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_DAT2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_DAT2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name SD0_D3 (coord T12), J32[1]/SD_DAT3
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_DAT3_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_DAT3_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_DAT3_CHANNEL 3                /*!<@brief Signal channel */
#define BOARD_INITUSDHCPINS_SD_DAT3_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_DAT3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_DAT3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO2_10 (coord T15), U23[3]/SD_RST_N
  @{ */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_RST_N_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_RST_N_SIGNAL PIO2               /*!<@brief Signal name */
#define BOARD_INITUSDHCPINS_SD_RST_N_CHANNEL 10                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITUSDHCPINS_SD_RST_N_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_RST_N_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITUSDHCPINS_SD_RST_N_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_RST_N_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_RST_N_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO2_4 (coord T13), J32[11]/CARD_WR_PRT/SD_WR_PRT
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_SIGNAL PIO2
/*!
 * @brief Signal channel */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_CHANNEL 4

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_GPIO_PIN_MASK (1U << 4U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_PIN 4U
/*!
 * @brief PORT pin mask */
#define BOARD_INITUSDHCPINS_SD_WR_PRT_PIN_MASK (1U << 4U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void); /* Function assigned for the Cortex-M33 */

