gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
/*! @name FLEXSPI0B_DATA1 (coord M2), U19[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_SIGNAL FLEXSPI_B_DATA1    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_DATA2 (coord N1), U19[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_SIGNAL FLEXSPI_B_DATA2    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_DATA3 (coord N2), U19[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_SIGNAL FLEXSPI_B_DATA3    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_DATA4 (coord U1), U19[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_SIGNAL FLEXSPI_B_DATA4    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_DATA5 (coord R2), U19[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_SIGNAL FLEXSPI_B_DATA5    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_DATA6 (coord P3), U19[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_SIGNAL FLEXSPI_B_DATA6    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_DATA7 (coord P5), U19[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_SIGNAL FLEXSPI_B_DATA7    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name FLEXSPI0B_SCLK (coord U3), U19[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_SIGNAL FLEXSPI_B_SCLK     /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name FLEXSPI0B_SS0_N (coord T2), U19[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_PERIPHERAL FLEXSPI        /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_SIGNAL FLEXSPI_B_SS0_B    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPI0BPins(void); /* Function assigned for the Cortex-M33 */
#endif
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord J16), J28[4]/JP30[1]/J45[22]
  @{ */
/* Routed pin properties */
#define BOARD_INITSCOPINS_ACC_INT_PERIPHERAL FLEXCOMM5           /*!<@brief Peripheral name */
#define BOARD_INITSCOPINS_ACC_INT_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITSCOPINS_ACC_INT_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSCOPINS_ACC_INT_PIN 5U                         /*!<@brief PORT pin number */
#define BOARD_INITSCOPINS_ACC_INT_PIN_MASK (1U << 5U)            /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitScoPins(void); /* Function assigned for the Cortex-M33 */

