gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_3 (coord H2), J1[3]/J36[4]/J45[58]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFOURDBGPINS_DbgPin5_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITFOURDBGPINS_DbgPin5_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_INITFOURDBGPINS_DbgPin5_CHANNEL 3

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin5_GPIO GPIO
/*!
 * @brief GPIO output initial state */
#define BOARD_INITFOURDBGPINS_DbgPin5_INIT_GPIO_VALUE 0U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin5_GPIO_PIN_MASK (1U << 3U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin5_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITFOURDBGPINS_DbgPin5_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin5_PIN_MASK (1U << 3U)
/* @} */

/*! @name PIO0_4 (coord J1), J1[5]/J45[60]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFOURDBGPINS_DbgPin6_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITFOURDBGPINS_DbgPin6_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_INITFOURDBGPINS_DbgPin6_CHANNEL 4

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin6_GPIO GPIO
/*!
 * @brief GPIO output initial state */
#define BOARD_INITFOURDBGPINS_DbgPin6_INIT_GPIO_VALUE 0U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin6_GPIO_PIN_MASK (1U << 4U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin6_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITFOURDBGPINS_DbgPin6_PIN 4U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin6_PIN_MASK (1U << 4U)
/* @} */

/*! @name PIO0_19 (coord A1), J30[3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFOURDBGPINS_DbgPin7_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITFOURDBGPINS_DbgPin7_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_INITFOURDBGPINS_DbgPin7_CHANNEL 19

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin7_GPIO GPIO
/*!
 * @brief GPIO output initial state */
#define BOARD_INITFOURDBGPINS_DbgPin7_INIT_GPIO_VALUE 0U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin7_GPIO_PIN_MASK (1U << 19U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin7_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITFOURDBGPINS_DbgPin7_PIN 19U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin7_PIN_MASK (1U << 19U)
/* @} */

/*! @name PIO0_20 (coord B2), J30[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFOURDBGPINS_DbgPin8_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITFOURDBGPINS_DbgPin8_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_INITFOURDBGPINS_DbgPin8_CHANNEL 20

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin8_GPIO GPIO
/*!
 * @brief GPIO output initial state */
#define BOARD_INITFOURDBGPINS_DbgPin8_INIT_GPIO_VALUE 0U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin8_GPIO_PIN_MASK (1U << 20U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFOURDBGPINS_DbgPin8_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITFOURDBGPINS_DbgPin8_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFOURDBGPINS_DbgPin8_PIN_MASK (1U << 20U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFourDbgPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PDM_CLK01 (coord R1), U40[4]/U41[4]/PDM_CLK01_OnBoard
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_CLK01_PERIPHERAL DMIC0
/*!
 * @brief Signal name */
#define BOARD_INITDMICPINS_PDM_CLK01_SIGNAL CLK
/*!
 * @brief Signal channel */
#define BOARD_INITDMICPINS_PDM_CLK01_CHANNEL 0_1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_CLK01_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_CLK01_PIN 16U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDMICPINS_PDM_CLK01_PIN_MASK (1U << 16U)
/* @} */

/*! @name PDM_DATA01 (coord U2), U40[1]/U41[1]/PDM_DATA01_OnBoard
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_DATA01_PERIPHERAL DMIC0
/*!
 * @brief Signal name */
#define BOARD_INITDMICPINS_PDM_DATA01_SIGNAL DATA
/*!
 * @brief Signal channel */
#define BOARD_INITDMICPINS_PDM_DATA01_CHANNEL 0_1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_DATA01_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_DATA01_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDMICPINS_PDM_DATA01_PIN_MASK (1U << 20U)
/* @} */

/*! @name PDM_DATA23 (coord R3), J31[6]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_PDM_DATA23_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_DATA23_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITDMICPINS_PDM_DATA23_CHANNEL 2_3               /*!<@brief Signal channel */
#define BOARD_INITDMICPINS_PDM_DATA23_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_DATA23_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_DATA23_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                /* @} */

