gillwei7/QAR87_NXP_RT685_main/BT_Audio_with_full_audio_path/Rt685Conversa_handsfree_cm33/source/pin_mux.h
/*! @name PDM_DATA45 (coord P3), U19[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_PDM_DATA45_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_DATA45_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITDMICPINS_PDM_DATA45_CHANNEL 4_5               /*!<@brief Signal channel */
#define BOARD_INITDMICPINS_PDM_DATA45_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_DATA45_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_DATA45_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PDM_DATA67 (coord P5), U19[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_PDM_DATA67_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_DATA67_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITDMICPINS_PDM_DATA67_CHANNEL 6_7               /*!<@brief Signal channel */
#define BOARD_INITDMICPINS_PDM_DATA67_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_DATA67_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_DATA67_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PDM_CLK23 (coord U1), U19[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_PDM_CLK23_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_CLK23_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITDMICPINS_PDM_CLK23_CHANNEL 2_3               /*!<@brief Signal channel */
#define BOARD_INITDMICPINS_PDM_CLK23_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_CLK23_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_CLK23_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PDM_CLK45 (coord R2), U19[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_PDM_CLK45_PERIPHERAL DMIC0          /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_PDM_CLK45_SIGNAL CLK                /*!<@brief Signal name */
#define BOARD_INITDMICPINS_PDM_CLK45_CHANNEL 4_5               /*!<@brief Signal channel */
#define BOARD_INITDMICPINS_PDM_CLK45_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_PDM_CLK45_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_PDM_CLK45_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDmicPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif



#if UsingQAR87Board == 1

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDevGpioPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDevIBtUartPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDevDebugUartFC2Pins(void); /* Function assigned for the Cortex-M33 */

